tutorials/untested/testSteffanMaxwell/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}

reactionSourceAMassIW
{
    type            coded;
    active          yes;
    name	        reactionSourceCOIW;
    selectionMode   all;

    // field 		        CO;
    field 		        AMass;

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{        
        #include "../../constant/rnTerms/loadCommonData.H"      
        
        word currSpName("AMass");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                 
    #};
}

reactionSourceBMassIW
{
    type            coded;
    active          yes;
    name	        reactionSourceCOIW;
    selectionMode   all;

    // field 		        CO;
    field 		        BMass;

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{        
        #include "../../constant/rnTerms/loadCommonData.H"      
        
        word currSpName("BMass");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                 
    #};
}

reactionSourceCMassIW
{
    type            coded;
    active          yes;
    name	        reactionSourceCOIW;
    selectionMode   all;

    // field 		        CO;
    field 		        CMass;

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{        
        #include "../../constant/rnTerms/loadCommonData.H"      
        
        word currSpName("CMass");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                 
    #};
}

// reactionSourceAIW
// {
//     type            coded;
//     active          yes;
//     name	        reactionSourceCOIW;
//     selectionMode   all;

//     // field 		        CO;
//     field 		        A;

//     codeInclude
//     #{
//         #include "fvCFD.H"
//     #};

//     codeAddRhoSup
//     #{        
//         #include "../../constant/rnTerms/loadCommonData.H"      
        
//         word currSpName("A");
        
//         #include "../../constant/rnTerms/r_powerLawV3.H"                 
//     #};
// }

// reactionSourceBIW
// {
//     type            coded;
//     active          yes;
//     name	        reactionSourceCOIW;
//     selectionMode   all;

//     // field 		        CO;
//     field 		        B;

//     codeInclude
//     #{
//         #include "fvCFD.H"
//     #};

//     codeAddRhoSup
//     #{        
//         #include "../../constant/rnTerms/loadCommonData.H"      
        
//         word currSpName("B");
        
//         #include "../../constant/rnTerms/r_powerLawV3.H"                 
//     #};
// }

// reactionSourceCIW
// {
//     type            coded;
//     active          yes;
//     name	        reactionSourceCOIW;
//     selectionMode   all;

//     // field 		        CO;
//     field 		        C;

//     codeInclude
//     #{
//         #include "fvCFD.H"
//     #};

//     codeAddRhoSup
//     #{        
//         #include "../../constant/rnTerms/loadCommonData.H"      
        
//         word currSpName("C");
        
//         #include "../../constant/rnTerms/r_powerLawV3.H"                 
//     #};
// }

reactionSourceEthyleneIW
{
    type            coded;
    active          yes;
    name	        reactionSourceCOIW;
    selectionMode   all;

    // field 		        CO;
    field 		        ethylene;

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{        
        #include "../../constant/rnTerms/loadCommonData.H"      
        
        word currSpName("ethylene");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                 
    #};
}

reactionSourceProdIW
{
    type            coded;
    active          yes;
    name	        reactionSourceCOIW;
    selectionMode   all;

    // field 		        CO;
    // field 		        ethylene;
    field 		        prod;

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{        
        #include "../../constant/rnTerms/loadCommonData.H"      
        
        word currSpName("prod");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                 
    #};
}


enthalpySourceINWALL
{
    type            coded;	
    active          yes;
    name	        enthalpySourceINWALL;
    selectionMode   all;

    field 		        "T";
    
    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{            
        #include "../../constant/rnTerms/loadCommonData.H"     
                    
        #include "../../constant/rnTerms/compEnthV2.H"                 
    #};
}