tutorials/untested/testSteffanMaxwell/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name coatZoneSet;
        type cellSet;
        action new;
        // source surfaceToCell;
        // sourceInfo
        // {
        //     file            "constant/triSurface/rashigs6.stl";
        //     useSurfaceOrientation true;  // use closed surface inside/outside
        //                                     // test (ignores includeCut,
        //                                     // outsidePoints)
        //     outsidePoints   ((0 0 0));    // definition of outside
        //     includeCut      false;              // cells cut by surface
        //     includeInside   true;              // cells not on outside of surf
        //     includeOutside  false;              // cells on outside of surf
        //     nearDistance    -1;                 // cells with centre near surf
        //                                         // (set to -1 if not used)
        //     curvature       -100;                // cells within nearDistance
        //                                         // and near surf curvature
        //                                         // (set to -100 if not used)
        //     fileType        stl;
        //     scale           -1;
        // }
        source boxToCell;
        sourceInfo
        {
            // box   (0.005 0.0007 0.0007) (0.01 0.0013 0.0013);
            box   (0.005 -0.0007 -0.0007) (0.007 1.0013 1.0013);
            //boxes   ((0 0 0) (1 1 1) (10 10 10)(11 11 11));
        }
    }
    {
        name coatZone;
        type cellZoneSet;
        action new;
        source setToCellZone;
        sourceInfo
        {
            set coatZoneSet;           // name of cellSet
        }
    }
);

// ************************************************************************* //
